# GetCurrent Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MacroModuleIterator..::..GetCurrent Method
MacroModuleIterator Class See Also
---
Returns the current Macro.
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public Macro GetCurrent()
```

Visual Basic
---
```text
Public Function GetCurrent As Macro
```

Visual C++
---
```text
public:
Macro^ GetCurrent()
```

# ### Return Value
The current Macro.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | There is no current item in the iterator. |

# See Also
MacroModuleIterator Class
Autodesk.Revit.DB.Macros Namespace